
#+TITLE: Configuración Emacs
#+author: Álvaro González (@alvarogonzalez)
#+OPTIONS: toc:2 h:4 author:t


#+latex: \newpage
#+html: <div style="margin:auto; text-align:center; font-size:1.5em">
#+latex: \begin{center}
La última versión de esta configuración puede encontrarse en [[https://github.com/alvarogonzalezsotillo/.emacs.d][https://github.com/alvarogonzalezsotillo/.emacs.d]].
#+latex: \end{center}
#+html: </div>

* Utilidades externas al /PATH/
En el directorio =~/.emacs.d/bin/= guardo algunas utilidades que me interesa tener en todos los entornos de trabajo. Lo siguiente es para que estén disponibles desde las /shells/ que arranque desde emacs.

Añado también el directorio de =cargo= para =rust=.
#+begin_src emacs-lisp

(let 
  (  
     (exec-path-separator  (if (string-equal system-type "windows-nt") ";" ":"))
     (paths `(
              ,(concat (expand-file-name user-emacs-directory) "bin")
              ,(concat (expand-file-name "~/") ".cargo/bin")
              "/opt/scala/bin" ))
  )
  (dolist (path paths)
    (message "path: %s" path)
    (setenv "PATH" (concat path exec-path-separator (getenv "PATH")))
    (add-to-list 'exec-path path)
  )

  (message "PATH %s" (getenv "PATH"))
  (message "exec-path %s" exec-path)
)

#+end_src

#+RESULTS:
: exec-path (/opt/scala/bin /home/alvaro/.emacs.d/bin /home/alvaro/.local/bin /home/alvaro/.cargo/bin /usr/local/sbin /usr/local/bin /usr/sbin /usr/bin /sbin /bin /usr/games /usr/local/games /snap/bin /usr/local/libexec/emacs/28.0.50/x86_64-pc-linux-gnu)



Las utilidades pueden consultarse en el [[https://github.com/alvarogonzalezsotillo/.emacs.d/tree/master/bin][repositorio en github]], y son:
#+begin_src shell :exports results
ls ~/.emacs.d/bin
#+end_src

#+RESULTS:
| addtopath.sh                 |
| colores-terminal.sh          |
| colores-tty.sh               |
| disable-gnome-animations.sh  |
| ec                           |
| ghpages.sh                   |
| gifttolatex                  |
| githubclone.sh               |
| install-emacs-as-service.org |
| invert.sh                    |
| keymon.sh                    |
| pdf2svg.sh                   |
| plantuml.1.2018.11.jar       |
| rmtemplatex.sh               |
| rotate-screen.sh             |
| shellcheck                   |
| shrinkpdf.sh                 |
| svg2pdf.sh                   |
| texlab                       |
| video-to-whatsapp.sh         |
| vncserver.sh                 |
| wake-alvarogonzalez.sh       |


*** Paquete =ox-epub=

#+begin_src emacs-lisp
(use-package ox-epub
  :ensure t
  :defer 1
)


#+end_src

#+RESULTS:
: [nil 0 1 0 nil require (ox-epub nil t) idle 0]

** Cursor
Cursor como barra vertical
#+begin_src emacs-lisp
(set-default 'cursor-type 'bar)
(set-default 'cursor-in-non-selected-windows 'hollow)
(defun my/change-cursor-when-overwrite ()
  (setq cursor-type (if overwrite-mode 'box 'bar)))
(add-hook 'overwrite-mode-hook #'my/change-cursor-when-overwrite)
(blink-cursor-mode 1)
(setq blink-cursor-blinks 0)
#+end_src

#+RESULTS:
: 0

